micropython/micropython/stmhal/hal/f2/src/stm32f2xx_hal_sd.c
  /* Byte 5 */
  tmp = (uint8_t)((hsd->CID[1] & 0x00FF0000) >> 16);
  pCardInfo->SD_cid.ProdName1 |= tmp << 8;
  
  /* Byte 6 */
  tmp = (uint8_t)((hsd->CID[1] & 0x0000FF00) >> 8);
  pCardInfo->SD_cid.ProdName1 |= tmp;
  
  /* Byte 7 */
  tmp = (uint8_t)(hsd->CID[1] & 0x000000FF);
  pCardInfo->SD_cid.ProdName2 = tmp;
  
  /* Byte 8 */
  tmp = (uint8_t)((hsd->CID[2] & 0xFF000000) >> 24);
  pCardInfo->SD_cid.ProdRev = tmp;
  
  /* Byte 9 */
  tmp = (uint8_t)((hsd->CID[2] & 0x00FF0000) >> 16);
  pCardInfo->SD_cid.ProdSN = tmp << 24;
  
  /* Byte 10 */
  tmp = (uint8_t)((hsd->CID[2] & 0x0000FF00) >> 8);
  pCardInfo->SD_cid.ProdSN |= tmp << 16;
  
  /* Byte 11 */
  tmp = (uint8_t)(hsd->CID[2] & 0x000000FF);
  pCardInfo->SD_cid.ProdSN |= tmp << 8;
  
  /* Byte 12 */
  tmp = (uint8_t)((hsd->CID[3] & 0xFF000000) >> 24);
  pCardInfo->SD_cid.ProdSN |= tmp;
  
  /* Byte 13 */
  tmp = (uint8_t)((hsd->CID[3] & 0x00FF0000) >> 16);
  pCardInfo->SD_cid.Reserved1   |= (tmp & 0xF0) >> 4;
  pCardInfo->SD_cid.ManufactDate = (tmp & 0x0F) << 8;
  
  /* Byte 14 */
  tmp = (uint8_t)((hsd->CID[3] & 0x0000FF00) >> 8);
  pCardInfo->SD_cid.ManufactDate |= tmp;
  
  /* Byte 15 */
  tmp = (uint8_t)(hsd->CID[3] & 0x000000FF);
  pCardInfo->SD_cid.CID_CRC   = (tmp & 0xFE) >> 1;
  pCardInfo->SD_cid.Reserved2 = 1;
  
  return errorState;
}

/**
  * @brief  Enables wide bus operation for the requested card if supported by 
  *         card.
  * @param  hsd: SD handle       
  * @param  WideMode: Specifies the SD card wide bus mode 
  *          This parameter can be one of the following values:
  *            @arg SDIO_BUS_WIDE_8B: 8-bit data transfer (Only for MMC)
  *            @arg SDIO_BUS_WIDE_4B: 4-bit data transfer
  *            @arg SDIO_BUS_WIDE_1B: 1-bit data transfer
  * @retval SD Card error state
  */
HAL_SD_ErrorTypedef HAL_SD_WideBusOperation_Config(SD_HandleTypeDef *hsd, uint32_t WideMode)
{
  HAL_SD_ErrorTypedef errorState = SD_OK;
  SDIO_InitTypeDef Init;
  
  /* MMC Card does not support this feature */
  if (hsd->CardType == MULTIMEDIA_CARD)
  {
    errorState = SD_UNSUPPORTED_FEATURE;
    
    return errorState;
  }
  else if ((hsd->CardType == STD_CAPACITY_SD_CARD_V1_1) || (hsd->CardType == STD_CAPACITY_SD_CARD_V2_0) ||\
    (hsd->CardType == HIGH_CAPACITY_SD_CARD))
  {
    if (WideMode == SDIO_BUS_WIDE_8B)
    {
      errorState = SD_UNSUPPORTED_FEATURE;
      
      return errorState;
    }
    else if (WideMode == SDIO_BUS_WIDE_4B)
    {
      errorState = SD_WideBus_Enable(hsd);
      
      if (errorState == SD_OK)
      {
        /* Configure the SDIO peripheral */
        Init.ClockEdge           = SDIO_CLOCK_EDGE_RISING;
        Init.ClockBypass         = SDIO_CLOCK_BYPASS_DISABLE;
        Init.ClockPowerSave      = SDIO_CLOCK_POWER_SAVE_DISABLE;
        Init.BusWide             = SDIO_BUS_WIDE_4B;
        Init.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
        Init.ClockDiv            = SDIO_TRANSFER_CLK_DIV;
        
        /* Configure SDIO peripheral interface */
        SDIO_Init(hsd->Instance, Init);
      }
    }
    else
    {
      errorState = SD_WideBus_Disable(hsd);
      
      if (errorState == SD_OK)
      {
        /* Configure the SDIO peripheral */
        Init.ClockEdge           = SDIO_CLOCK_EDGE_RISING;
        Init.ClockBypass         = SDIO_CLOCK_BYPASS_DISABLE;
        Init.ClockPowerSave      = SDIO_CLOCK_POWER_SAVE_DISABLE;
        Init.BusWide             = SDIO_BUS_WIDE_1B;
        Init.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
        Init.ClockDiv            = SDIO_TRANSFER_CLK_DIV;
        
        /* Configure SDIO peripheral interface */
        SDIO_Init(hsd->Instance, Init);
      }
    }
  }
  
  return errorState;
}

/**
  * @brief  Aborts an ongoing data transfer.
  * @param  hsd: SD handle
  * @retval SD Card error state
  */
HAL_SD_ErrorTypedef HAL_SD_StopTransfer(SD_HandleTypeDef *hsd)
{
  SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
  HAL_SD_ErrorTypedef errorState = SD_OK;
  
  /* Send CMD12 STOP_TRANSMISSION  */
  SDIO_CmdInitStructure.Argument         = 0;
  SDIO_CmdInitStructure.CmdIndex         = SD_CMD_STOP_TRANSMISSION;
  SDIO_CmdInitStructure.Response         = SDIO_RESPONSE_SHORT;
  SDIO_CmdInitStructure.WaitForInterrupt = SDIO_WAIT_NO;
  SDIO_CmdInitStructure.CPSM             = SDIO_CPSM_ENABLE;
  SDIO_SendCommand(hsd->Instance, &SDIO_CmdInitStructure);
  
  /* Check for error conditions */
  errorState = SD_CmdResp1Error(hsd, SD_CMD_STOP_TRANSMISSION);
  
  return errorState;
}

/**
  * @brief  Switches the SD card to High Speed mode.
  *         This API must be used after "Transfer State"
  * @note   This operation should be followed by the configuration 
  *         of PLL to have SDIOCK clock between 67 and 75 MHz
  * @param  hsd: SD handle
  * @retval SD Card error state
  */
HAL_SD_ErrorTypedef HAL_SD_HighSpeed (SD_HandleTypeDef *hsd)
{
  HAL_SD_ErrorTypedef errorState = SD_OK;
  SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
  SDIO_DataInitTypeDef SDIO_DataInitStructure;
  
  uint8_t SD_hs[64]  = {0};
  uint32_t SD_scr[2] = {0, 0};
  uint32_t SD_SPEC   = 0 ;
  uint32_t count = 0, *tempbuff = (uint32_t *)SD_hs;
  
  /* Initialize the Data control register */
  hsd->Instance->DCTRL = 0;
  
  /* Get SCR Register */
  errorState = SD_FindSCR(hsd, SD_scr);
  
  if (errorState != SD_OK)
  {
    return errorState;
  }
  
  /* Test the Version supported by the card*/ 
  SD_SPEC = (SD_scr[1]  & 0x01000000) | (SD_scr[1]  & 0x02000000);
  
  if (SD_SPEC != SD_ALLZERO)
  {
    /* Set Block Size for Card */
    SDIO_CmdInitStructure.Argument         = (uint32_t)64;
    SDIO_CmdInitStructure.CmdIndex         = SD_CMD_SET_BLOCKLEN;
    SDIO_CmdInitStructure.Response         = SDIO_RESPONSE_SHORT;
    SDIO_CmdInitStructure.WaitForInterrupt = SDIO_WAIT_NO;
    SDIO_CmdInitStructure.CPSM             = SDIO_CPSM_ENABLE;
    SDIO_SendCommand(hsd->Instance, &SDIO_CmdInitStructure);
    
    /* Check for error conditions */
    errorState = SD_CmdResp1Error(hsd, SD_CMD_SET_BLOCKLEN);
    
    if (errorState != SD_OK)
    {
      return errorState;
    }
    
    /* Configure the SD DPSM (Data Path State Machine) */
    SDIO_DataInitStructure.DataTimeOut   = SD_DATATIMEOUT;
    SDIO_DataInitStructure.DataLength    = 64;
    SDIO_DataInitStructure.DataBlockSize = SDIO_DATABLOCK_SIZE_64B ;
    SDIO_DataInitStructure.TransferDir   = SDIO_TRANSFER_DIR_TO_SDIO;
    SDIO_DataInitStructure.TransferMode  = SDIO_TRANSFER_MODE_BLOCK;
    SDIO_DataInitStructure.DPSM          = SDIO_DPSM_ENABLE;
    SDIO_DataConfig(hsd->Instance, &SDIO_DataInitStructure);
    
    /* Send CMD6 switch mode */
    SDIO_CmdInitStructure.Argument         = 0x80FFFF01;
    SDIO_CmdInitStructure.CmdIndex         = SD_CMD_HS_SWITCH;
    SDIO_SendCommand(hsd->Instance, &SDIO_CmdInitStructure); 
    
    /* Check for error conditions */
    errorState = SD_CmdResp1Error(hsd, SD_CMD_HS_SWITCH);
    
    if (errorState != SD_OK)
    {
      return errorState;
    }
        
    while(!__HAL_SD_SDIO_GET_FLAG(hsd, SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR))
    {
      if (__HAL_SD_SDIO_GET_FLAG(hsd, SDIO_FLAG_RXFIFOHF))
      {
        for (count = 0; count < 8; count++)
        {
          *(tempbuff + count) = SDIO_ReadFIFO(hsd->Instance);
        }
        
        tempbuff += 8;
      }
    }
    
    if (__HAL_SD_SDIO_GET_FLAG(hsd, SDIO_FLAG_DTIMEOUT))
    {
      __HAL_SD_SDIO_CLEAR_FLAG(hsd, SDIO_FLAG_DTIMEOUT);
      
      errorState = SD_DATA_TIMEOUT;
      
