micropython/micropython/stmhal/hal/f2/src/stm32f2xx_hal_sd.c
  return errorState;
}

/**
  * @brief  Enquires cards about their operating voltage and configures clock
  *         controls and stores SD information that will be needed in future
  *         in the SD handle.
  * @param  hsd: SD handle
  * @retval SD Card error state
  */
static HAL_SD_ErrorTypedef SD_PowerON(SD_HandleTypeDef *hsd)
{
  SDIO_CmdInitTypeDef SDIO_CmdInitStructure; 
  __IO HAL_SD_ErrorTypedef errorState = SD_OK; 
  uint32_t response = 0, count = 0, validvoltage = 0;
  uint32_t SDType = SD_STD_CAPACITY;
  
  /* Power ON Sequence -------------------------------------------------------*/
  /* Disable SDIO Clock */
  __HAL_SD_SDIO_DISABLE(); 
  
  /* Set Power State to ON */
  SDIO_PowerState_ON(hsd->Instance);
  
  /* Enable SDIO Clock */
  __HAL_SD_SDIO_ENABLE();
  
  /* CMD0: GO_IDLE_STATE -----------------------------------------------------*/
  /* No CMD response required */
  SDIO_CmdInitStructure.Argument         = 0;
  SDIO_CmdInitStructure.CmdIndex         = SD_CMD_GO_IDLE_STATE;
  SDIO_CmdInitStructure.Response         = SDIO_RESPONSE_NO;
  SDIO_CmdInitStructure.WaitForInterrupt = SDIO_WAIT_NO;
  SDIO_CmdInitStructure.CPSM             = SDIO_CPSM_ENABLE;
  SDIO_SendCommand(hsd->Instance, &SDIO_CmdInitStructure);
  
  /* Check for error conditions */
  errorState = SD_CmdError(hsd);
  
  if(errorState != SD_OK)
  {
    /* CMD Response TimeOut (wait for CMDSENT flag) */
    return errorState;
  }
  
  /* CMD8: SEND_IF_COND ------------------------------------------------------*/
  /* Send CMD8 to verify SD card interface operating condition */
  /* Argument: - [31:12]: Reserved (shall be set to '0')
  - [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
  - [7:0]: Check Pattern (recommended 0xAA) */
  /* CMD Response: R7 */
  SDIO_CmdInitStructure.Argument         = SD_CHECK_PATTERN;
  SDIO_CmdInitStructure.CmdIndex         = SD_SDIO_SEND_IF_COND;
  SDIO_CmdInitStructure.Response         = SDIO_RESPONSE_SHORT;
  SDIO_SendCommand(hsd->Instance, &SDIO_CmdInitStructure);
  
  /* Check for error conditions */ 
  errorState = SD_CmdResp7Error(hsd);
  
  if (errorState == SD_OK)
  {
    /* SD Card 2.0 */
    hsd->CardType = STD_CAPACITY_SD_CARD_V2_0; 
    SDType        = SD_HIGH_CAPACITY;
  }
  
  /* Send CMD55 */
  SDIO_CmdInitStructure.Argument         = 0;
  SDIO_CmdInitStructure.CmdIndex         = SD_CMD_APP_CMD;
  SDIO_SendCommand(hsd->Instance, &SDIO_CmdInitStructure);
  
  /* Check for error conditions */
  errorState = SD_CmdResp1Error(hsd, SD_CMD_APP_CMD);
  
  /* If errorState is Command TimeOut, it is a MMC card */
  /* If errorState is SD_OK it is a SD card: SD card 2.0 (voltage range mismatch)
     or SD card 1.x */
  if(errorState == SD_OK)
  {
    /* SD CARD */
    /* Send ACMD41 SD_APP_OP_COND with Argument 0x80100000 */
    while((!validvoltage) && (count < SD_MAX_VOLT_TRIAL))
    {
      
      /* SEND CMD55 APP_CMD with RCA as 0 */
      SDIO_CmdInitStructure.Argument         = 0;
      SDIO_CmdInitStructure.CmdIndex         = SD_CMD_APP_CMD;
      SDIO_CmdInitStructure.Response         = SDIO_RESPONSE_SHORT;
      SDIO_CmdInitStructure.WaitForInterrupt = SDIO_WAIT_NO;
      SDIO_CmdInitStructure.CPSM             = SDIO_CPSM_ENABLE;
      SDIO_SendCommand(hsd->Instance, &SDIO_CmdInitStructure);
      
      /* Check for error conditions */
      errorState = SD_CmdResp1Error(hsd, SD_CMD_APP_CMD);
      
      if(errorState != SD_OK)
      {
        return errorState;
      }
      
      /* Send CMD41 */
      SDIO_CmdInitStructure.Argument         = SD_VOLTAGE_WINDOW_SD | SDType;
      SDIO_CmdInitStructure.CmdIndex         = SD_CMD_SD_APP_OP_COND;
      SDIO_CmdInitStructure.Response         = SDIO_RESPONSE_SHORT;
      SDIO_CmdInitStructure.WaitForInterrupt = SDIO_WAIT_NO;
      SDIO_CmdInitStructure.CPSM             = SDIO_CPSM_ENABLE;
      SDIO_SendCommand(hsd->Instance, &SDIO_CmdInitStructure);
      
      /* Check for error conditions */
      errorState = SD_CmdResp3Error(hsd);
      
      if(errorState != SD_OK)
      {
        return errorState;
      }
      
      /* Get command response */
      response = SDIO_GetResponse(SDIO_RESP1);
      
      /* Get operating voltage*/
      validvoltage = (((response >> 31) == 1) ? 1 : 0);
      
      count++;
    }
    
    if(count >= SD_MAX_VOLT_TRIAL)
    {
      errorState = SD_INVALID_VOLTRANGE;
      
      return errorState;
    }
    
    if((response & SD_HIGH_CAPACITY) == SD_HIGH_CAPACITY) /* (response &= SD_HIGH_CAPACITY) */
    {
      hsd->CardType = HIGH_CAPACITY_SD_CARD;
    }
    
  } /* else MMC Card */
  
  return errorState;
}

/**
  * @brief  Turns the SDIO output signals off.
  * @param  hsd: SD handle
  * @retval SD Card error state
  */
static HAL_SD_ErrorTypedef SD_PowerOFF(SD_HandleTypeDef *hsd)
{
  HAL_SD_ErrorTypedef errorState = SD_OK;
  
  /* Set Power State to OFF */
  SDIO_PowerState_OFF(hsd->Instance);
  
  return errorState;
}

/**
  * @brief  Returns the current card's status.
  * @param  hsd: SD handle
  * @param  pCardStatus: pointer to the buffer that will contain the SD card 
  *         status (Card Status register)  
  * @retval SD Card error state
  */
static HAL_SD_ErrorTypedef SD_SendStatus(SD_HandleTypeDef *hsd, uint32_t *pCardStatus)
{
  SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
  HAL_SD_ErrorTypedef errorState = SD_OK;
  
  if(pCardStatus == NULL)
  {
    errorState = SD_INVALID_PARAMETER;
    
    return errorState;
  }
  
  /* Send Status command */
  SDIO_CmdInitStructure.Argument         = (uint32_t)(hsd->RCA << 16);
  SDIO_CmdInitStructure.CmdIndex         = SD_CMD_SEND_STATUS;
  SDIO_CmdInitStructure.Response         = SDIO_RESPONSE_SHORT;
  SDIO_CmdInitStructure.WaitForInterrupt = SDIO_WAIT_NO;
  SDIO_CmdInitStructure.CPSM             = SDIO_CPSM_ENABLE;
  SDIO_SendCommand(hsd->Instance, &SDIO_CmdInitStructure);
  
  /* Check for error conditions */
  errorState = SD_CmdResp1Error(hsd, SD_CMD_SEND_STATUS);
  
  if(errorState != SD_OK)
  {
    return errorState;
  }
  
  /* Get SD card status */
  *pCardStatus = SDIO_GetResponse(SDIO_RESP1);
  
